[
    {
        "id":"anthropocene",
        "title":"Born in the Anthropocene",
        "tagline": "An interactive narrative exploring a sustainable future based in collective welfare and critical thought",
        "image":"./projectPreviewPics/anthropocene.png",
        "date":"November 2025, 2 week timeline",
        "type":"Class Project",
        "team":[["Ari Hammond","Writer, Twine Developer, Graphics Artist"], ["Noah Graff", "p5.js Developer, Graphics Artist"],  ["Case Dinkla", "p5.js Developer"],  ["Caden Terrell", "Writer"],  ["Sowmiyan Nattamai", "Writer"]],
        "problem":{
            "blurb":"Before we can work toward more positive futures, we have to imagine them. Work in a team to imagine a more sustainable future society.",
            "paragraph":"Despite the promising and novel innovations enabled by the advent of artificial intelligence (AI), this development has also had immediate and severe environmental impacts predicted to continue. In the face of rapidly changing climate and this new, ubiquitous environmental pressor, we must find and develop more sustainable structure for future generations"
        },
        "overview":{
            "summary":"This is a design futuring project assigned to demonstrate competencies in p5.js and with key concepts of computational media and design. We collaborated to employ these skillsets and design a sustainable future aligned with one or more UN Sustainable Development Goals, using fabulation as our main approach.",
            "goals":[["Propose ", "a sustainable future society"], ["Develop ", "an interactive program exploring the proposed society"]],
            "results":["An interactive narrative and integrated p5.js sketch where users make social/cultural decisions in the proposed future"],
            "tools":["Twine", "p5.js"]
        },
        "process":{
            "background":["UN SDGs", "Postmodernism", "Social Sustainability"],
            "citations":[["United Nations Sustainable Development Goals","https://sdgs.un.org/goals","United Nations Department of Economic and Social Affairs"],["Postmodern Education: Critiques and Alternatives to Traditional Schooling","https://sociology.institute/sociology-of-education/postmodern-education-critiques-alternatives/#what-is-postmodernism-in-education","Sociology.Institute"],["What is social sustainability?","https://instituteofsustainabilitystudies.com/insights/lexicon/what-is-social-sustainability/","The Institute of Sustainability Studies"]],
            "methods":[
                {
                    "title":"Brainstorming",
                    "summary":"We began with a 40 minute brainstorming session where we suggested different issues, societal structures, or narratives we might explore.",
                    "description":"",
                    "media":[["./caseStudyFiles/anthropocene/whiteboard.png","Brainstorming Session of Microsoft Whiteboard"], ["./caseStudyFiles/anthropocene/whiteboardClose.png","We settled on exploring culture and society since that's where we had the most ideas and common ground"]]
                },{
                    "title":"Proposed Concept",
                    "summary":"After brainstorming, we met to discuss and draft a proposal for our future world and interactive program.",
                    "description":"",
                    "media":[["./caseStudyFiles/anthropocene/projectProposal.pdf", "The proposal presentation, designed to be about 2 minutes long", "application/pdf"]]
                },{
                    "title":"Version 1",
                    "summary":"Our first version was only a p5.js sketch, which we submitted for feedback upon which to improve.",
                    "description":"",
                    "media":[]
                },{
                    "title":"Creating the Interactive Narrative",
                    "summary":"Based on feedback from version 1, we re-evaluated our proposal and decided an interactive narrative would be better fit for exploring our proposed society.",
                    "description":"",
                    "media":[["./caseStudyFiles/anthropocene/twineMap.png","Twine node map for the interactive narrative"]]
                }],
            "artifact": "https://arihammond.itch.io/born-in-the-anthropocene",
            "findings":["Strong introduction to design futuring and speculative design with digital media", "Developed a new research interest/application in using interactive narratives for design futuring","Allowed exposure to and familiarity with Twine for prototyping", "Improved collaborative communication, organization, and task delegation skills"]
        },
        "reflection":{
            "paragraph":"This project was a valuable opportunity to improve my understanding of Twine as a prototyping/development tool for hypertext narratives. I successfully translated a traditional narrative into hypertext, considering the branches of the narrative and how different choices allowed for the exploration of key themes in our proposed future.",
            "futureWork":"As my first foray into design futuring, it was fascinating to see how I may use interactive narratives as sites for speculative fiction. With more time, I would've liked to better establish the world of our proposed future, creating a cohesive and solid background upon which to explore the social and cultural determinants of sustainability."
        }
    },
    {
        "id":"museum",
        "title":"AI Museum Dataset",
        "tagline":"Web-based visualization/landing page for my AI Museum Dataset independent study in Fall 2025",
        "image" : "./projectPreviewPics/museum.png",
        "date":"November 2025",
        "type":"Research Supplement",
        "team": [["Ari Hammond", "Principal Investigator"], ["Dr. Abigale Stangl","Faculty Advisor"]],
        "problem":{
            "blurb":"How can we visualize a multimodal AI dataset for collaborative use and study design?",
            "paragraph":"This site is a visualization of 56-item dataset of artifact descriptions used in a design research study. When created, the dataset was not intended for research use and upon joining MultiSense.Studio and working under Dr. Stangl, I identified a need to better visualize and centralize the dataset so it could be referenced during the study and shared among my colleagues in the lab."
        },
        "overview":{
            "summary":"This is a web visualization of a multimodal dataset of mueseum artifacts and their descriptions to support an independent study on AI-mediated museum practices. The dataset includes images, label copy, LLM-generated and human-edited descriptions.",
            "goals":[["Visualize ", "a multimodal dataset, including text and images"],["Support ", "study design and inquiry for design research endeavors"]],
            "results":["A simple HTML site backed by JSON data that displays the experimental dataset as a table and has accompanying pages and content that act as a landing site for the core independent study"],
            "tools":["JSON", "HTML", "JavaScript"]
        },
        "process":{
            "background":["I created this dataset during my time as an accessibility intern at the Robert C. Williams Museum of Papermaking in summer 2025. Through an iterative process, I collected images of museum artifacts and accompanying label text, consulted museum and accessibility experts to develop skills in authoring alt text for museums, and prompted a large language model to generate descriptive text designed to function as both interpretive description and alt text for accessibility.", "This dataset will be used primarily in a design research study investigating how to design and evaluate documentation methods that promote critical reflection among museum professionals as they engage with AI-driven interpretive and accessibility systems. By framing dataset documentation as both a methodological and pedagogical practice, this study situates AI systems as collaborators in interpretive and ethical reflection and proposes alternative text as context documentation that reflects the interpretive, ethical, and communicative decisions embedded in multimodal museum data."],
            "citations":[["Datasheets for Datasets", "http://arxiv.org/abs/1803.09010","Timnit Gebru, et al."],["Datasheets for Digital Cultural Hertiage Datasets", "http://openhumanitiesdata.metajnl.com/articles/10.5334/johd.124/", "Henk Alkemade, et al."], ["Research on the Application of Artificial Intelligence to Accessibility Services in Science Museums","https://dl.acm.org/doi/10.1145/3736426.3736491","Pengfei Li, et al."]],
            "methods":[
                {
                    "title":"Structuring the Dataset for Usability",
                    "summary":"The dataset as created in the internship was stored as a PowerPoint presentation for internal use at the museum, but JSON offered a scaleable, structured, readable format that optimized the dataset for research contexts.",
                    "description":"",
                    "media":[]
                },{
                    "title":"Web Visualization as a Research Interface",
                    "summary":"Building on the idea of prioritizing structure and scalability, translating the JSON dataset to an HTML webpage allowed a succinct and clear visualization of both the compiled text and image data.",
                    "description":" The webpage allowed quick sharing and referencing of the dataset among myself, Dr. Stangl, and other lab members.",
                    "media":[]
                },{
                    "title":"Balancing Completeness and Readability in a Multimodal Dataset",
                    "summary":"For my particular study, the data is intended to be examined as a complete corpus, meaning the web visualization prioritized completeness and readability over interaction design.",
                    "description":"In this case, because the entire dataset needed to be viewed, I did not include a querying or search function for the HTML table. This did not, however, detract from readability because the structured table created clear separation between artifacts.",
                    "media":[]
                }],
            "artifact":"https://arihamm24.github.io/ai-museum-datasets/",
            "findings":["Centralized dataset and facilitated access, sharing, and reuse among lab members", "Introduced extended functionality by serving as a landing page for the independent study project", "Supported dataset evaluation, analysis, and study design by enabling external access to dataset", "Established a reusable model for lightweight web-based visualization of multimodal research datasets"]
        },
        "reflection":{
            "paragraph":"This site enabled remote sharing and access to the dataset during the study design and execution process, and using JSON allows for modularity and adaptability as new insights on AI-generated museum content arise throughout this study and future work. One major limitation of the site is the lack of querying and interactivity, as it is a static table of the dataset and its composite parts. This was a deliberate choice: the dataset was intended to be viewed as a complete corpus and applied to areas like model training and ethical evaluations, meaning preserving its integrity was prioritized over the usability benefits of a querying mechanism.",
            "futureWork":"This dataset was foundational to my independent study and connected to several other studies conducted by my fellow lab members. This simple, accessible visualization facilitated use and distribution of the dataset, suggesting that similar implementations for other experimental datasets would be an effective and necessary choice. Moreover, the decision to use this site as a central page for the independent study by including my abstract and linking to the publication enhances its functionality beyond data visualization to a scientific communication tool. These two uses could likely be replicated in future projects that center specific datasets."
        }
    },
    {
        "id":"jampacked",
        "title":"Jam Packed",
        "tagline":"A roller-derby video game developed for the mGBA emulator",
        "image":"./projectPreviewPics/jamPacked.png",
        "date":"October - December 2025, 7 week timeline",
        "type":"Class Project",
        "team": [["Ari Hammond", "Developer, Artist"]],
        "problem":{
            "blurb": "Take what you’ve learned this semester and turn it into a one-of-a-kind playable game!",
            "paragraph":"This course taught general high-level computing concepts like memory management, circuits, and Von Neumann Architecture, as well as game development concepts like sprites, interfacing with hardware, backgrounds, and animation. To demonstrate and solidify my grasp of the content, I developed an original, playable video game for the GameBoy Advanced, the chosen hardware interface for the course."
        },
        "overview":{
            "summary":"This is a final project for CS2261 (Media Device Architecture) at Georgia Tech. The course taught high-level computing in C via the GameBoy Advanced (GBA). For the final project, I designed and developed a roller derby video game for the GBA",
            "goals":[["Apply ", "concepts of high-level computing and fundamentals of C"], ["Demonstrate ", "creativity and understanding of GBA architecture"]],
            "results":["A playable, well-designed, original game developed in C"],
            "tools":["mGBA", "Tiled", "Usenti Sprite Editor"]
        },
        "process":{
            "background":["This course taught high-level programming in C and software and hardware interfacing, using the GameBoyAdvanced (GBA) as a medium to apply concepts like logical implementation and hardware manipulation. To demonstrate strong grasp of these concepts, the final project was to individual ideate, design, and develop a video game for the GBA for the final 6 weeks of class.", "To better sustain my interest and investment in the project beyond simply completing the course, I proposed a game tied to my favorite hobby: roller derby. Derby is a contact sport played with 5 skaters from each team. There is 1 scoring player, a jammer, and 4 defensive players, called blockers. It is fast-paced, dynamic, and wildly entertaining and has been a major part of my life since August 2024, so creating this game felt like a natural extension of this passion."],
            "citations":[["TONC", "https://www.coranac.com/tonc/text/","Jasper Vijn"],["Welcome to Roller Derby", "https://wftda.com/roller-derby-basics/","Women's Flat Track Derby Association (WFTDA)"]],
            "methods":[
                {
                    "title":"Game Proposal",
                    "summary":"The project began at Milestone 0, a brief proposal of the game to be submitted for review.",
                    "description":"In the proposal, I gave a synopsis of my game idea, a sports-genre roller derby game, and laid out basic controls, sound effects and background music, ideas/sketches for graphics, and possible ways to implement the concepts explored during the course, like parallax backgrounds and complex movement.",
                    "media":[["./caseStudyFiles/jampacked/proposal.pdf","The full proposal document","application/pdf"]]
                },{
                    "title":"State Machine and Basic Mechanics",
                    "summary":"Milestone 1 and 2 were implementing the architecture, state machine, and mechanics of the game.",
                    "description":"Based on the feedback from my grading TA, I revisited my proposal and began scaffolding the structure of my code, particularly the different files for different game states and objects, and implementing the basic movement mechanics with placeholder sprites (simple rectangles). I got feedback between each of these milestones, and by the end of this stage, I had fully implemented user controls, all of the game states, and reduced the scope of the project to make completion more plausible.",
                    "media":[["./caseStudyFiles/jampacked/trackCollision.png","The collision map of the track was key to the movement for computerized sprites (opponents, referees, allied tripod).","image/png"]]
                },{
                    "title":"Graphics, Sound, and Additional Features",
                    "summary":"Milestone 3 was a beta version of the game, including complete sound and graphics and gameplay that could lead to the win/lose states.",
                    "description":"The beta version of the game was a completely playable prototype, complete with sprites, instructional graphics, scoring for both the player and opponent, background music and sound effects. Though changes were made up until the deadline for completion and full realization of my ideas, this was an acceptable deliverable for the project.",
                    "media":[["./caseStudyFiles/jampacked/spritesheet.png","4-bit Tile Spritesheet","image/png"], ["./caseStudyFiles/jampacked/instruct.bmp","Tileset for Splash Screen and Instructional Page"]]
                }],
            "artifact": "https://arihamm24.github.io/jam-packed/",
            "findings":["Familiarized myself with iterative design, adapting to feedback, and adjusting to time/resource constraints as a developer", "Solidified grasp of course concepts, allowing for abstraction with other hardware and software systems", "Creative, functional, and engaging video game for resume/portfolio"]
        },
        "reflection":{
            "paragraph":"This project helped me develop skills in creative debugging, asset creation, code architecture, and adaptability as a developer. At several points, either due to time or resource constraints, I revisited my original proposal and made changes to ensure I could realize my idea to the best of my ability and make a functional, enjoyable game.",
            "futureWork":"Game development, and in a larger sense media devices, are integral areas of creative computing/technology, and this project/course laid the foundation of my exploration in the field. Though the course did not make me a full-fledged C developer, I gained useful technical, theoretical, and organizational skills as well as an interesting portfolio piece. I am eager to see how I may use these langauges, tools, and concepts in later research and creative endeavors."
        }
    },
    {
        "id":"travelmate",
        "title":"TravelMate",
        "tagline":"an interactive travel planning web application",
        "image" : "./projectPreviewPics/travelmate.png",
        "date":"April 2025, 3 week timeline",
        "type":"Class Project",
        "team":[["Ari Hammond", "Full Stack Developer, Front-end Designer"],["Mithil Cherkadi", "Full Stack Developer"], ["Jason Li","Product Manager, Back End Developer"], ["Neha Kunche","Scrum Master, Front End Developer"], ["Deepthi Munagapati", "Full Stack Developer"]],
        "problem": {
            "blurb":"Use Agile development methodologies to create a travel planning web application in Django.",
            "paragraph":"This course focused on teaching Agile software development through collaborative projects. For this project, we were tasked with developing a travel planning application that incorporated external APIs to give users responsive advice based on weather, desired activities, and location. In development, we used the extreme programming (XP) Agile methodology."
        },
        "overview":{
            "summary":"Using extreme programming (XP), an Agile software development methodology, my team and I developed a Django web-app for travel planning that incoporates external APIs for a custom, adaptive user experience. My primary role was with front-end design and back-end development.",
            "goals":[["Develop ", "web applications using Agile software methodologies"],["Incorporate ", "external APIs to create desired functionalities"], ["Demonstrate ", "competencies in web development"]],
            "results":["A multi-page responsive site with integrated Deepseek AI and Open Weather APIs for a customized, engaging travel planning experience"],
            "tools":["Django", "HTML", "Trello and MS Teams"]
        },
       "process":{
            "background":["Explanation of XP process"],
            "citations":[["Agile Software Development","https://www.geeksforgeeks.org/software-engineering/software-engineering-agile-software-development/","GeeksForGeeks"]],
            "methods":[
                {
                    "title":"User Stories and Prototyping",
                    "summary":"To begin, we individually wrote user stories and created low-fidelity paper prototypes for the TravelMate Web App.",
                    "description":"",
                    "media":[]
                },{
                    "title":"Sprint Planning",
                    "summary":"We met to assess and consolidate user stories, assign roles, and plan what to accomplish in each sprint.",
                    "description":"",
                    "media":[["./caseStudyFiles/travelmate/projectDesc.pdf", "The final project description","application/pdf"]]
                },{
                    "title":"Sprint 1",
                    "summary":"Sprint 1 focused on developing the database that would store trip and user data, key features like account registration, and the core travel planning form.",
                    "description":"",
                    "media":[["./caseStudyFiles/travelmate/wireframe1.png", "Wireframe for Trip Planning pages","image/png"], ["./caseStudyFiles/travelmate/wireframe2.png","Wireframe for Home and Login/SignUp pages", "image/png"]]
                },{
                    "title":"Sprint 2",
                    "summary":"In Sprint 2, we refined the features implemented in Sprint 1, implemented our chosen APIs, refactored for good architecture, and solidified the front-end design.",
                    "description":"",
                    "media":[]
                }],
            "artifact": "https://youtu.be/Bw96BV2pxgg",
            "findings":["Prepared me for industry by familiarizing me with Scrum dynamics and procedures", "Gained meaningful back-end web development experience with Django and SQLite", "Improved collaborative communication, organization, and task delegation skills"]
        },
        "reflection":{
            "paragraph":"This project introduced me to industry standard approaches to collaborative, user-focused software development by exposing me to Agile methodologies, API integrations, and simulating real-world client feedback. As I continue to develop as a computer scientist, this kind of structured collaboration and public-facing co-creation will help me develop more complex, complete, and coherent creative and academic computing projects.",
            "futureWork":"In the future, I may try other Scrum roles or contribute exlcusively to front- or back-end processes, as this project provided foundational knowledge for collaboration industry and academic software engineering contexts."    
        }
    }
]